turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S2C.atdf
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Flag" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Flag" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of DMA Interrupt Flag" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
          <bitfield caption="Bias Current Control for DAC Core" mask="0x00000300" name="IBCTLDACCORE"/>
        </register>
        <register caption="Write Protect Mode register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="DACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write protection error" mask="0x00000001" name="WPROTERR"/>
          <bitfield caption="Write protection error address" mask="0x0000FF00" name="WPROTADDR"/>
        </register>
        <register caption="Transmit Pointer Register" name="DACC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="DACC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="DACC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="DACC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="DACC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="DACC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__TRGEN">
        <value caption="External trigger mode disabled. DACC in free running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TRGSEL">
        <value caption="External trigger" name="TRGSEL0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="TRGSEL1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="TRGSEL2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="TRGSEL3" value="0x3"/>
        <value caption="PWM Event Line 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM Event Line 1" name="TRGSEL5" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="Half-Word transfer" name="HALF" value="0"/>
        <value caption="Word Transfer" name="WORD" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__SLEEP">
        <value caption="Normal Mode: The DAC Core and reference voltage circuitry are kept ON between conversions." name="DISABLED" value="0"/>
        <value caption="Sleep Mode: The DAC Core and/or reference voltage circuitry are OFF between conversions." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__FASTWKUP">
        <value caption="Normal Sleep Mode: The sleep mode is defined by the SLEEP bit. Voltage reference is OFF between conversions." name="STAMODE" value="0"/>
        <value caption="Fast Wake up after Sleep Mode: the voltage reference is kept ON between conversions but DAC Core is OFF" name="FASTWAKEUP" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__USER_SEL">
        <value caption="Channel 0" name="CHANNEL0" value="0"/>
        <value caption="Channel 1" name="CHANNEL1" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__TAG">
        <value caption="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." name="DIS" value="0"/>
        <value caption="Tag selection mode enabled" name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS">
        <value caption="Normal Mode" name="NORMAL" value="0"/>
        <value caption="Max Speed Mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__STARTUP">
        <value caption="0 periods of DACClock" name="_0" value="0x0"/>
        <value caption="8 periods of DACClock" name="_8" value="0x1"/>
        <value caption="16 periods of DACClock" name="_16" value="0x2"/>
        <value caption="24 periods of DACClock" name="_24" value="0x3"/>
        <value caption="64 periods of DACClock" name="_64" value="0x4"/>
        <value caption="80 periods of DACClock" name="_80" value="0x5"/>
        <value caption="96 periods of DACClock" name="_96" value="0x6"/>
        <value caption="112 periods of DACClock" name="_112" value="0x7"/>
        <value caption="512 periods of DACClock" name="_512" value="0x8"/>
        <value caption="576 periods of DACClock" name="_576" value="0x9"/>
        <value caption="640 periods of DACClock" name="_640" value="0xA"/>
        <value caption="704 periods of DACClock" name="_704" value="0xB"/>
        <value caption="768 periods of DACClock" name="_768" value="0xC"/>
        <value caption="832 periods of DACClock" name="_832" value="0xD"/>
        <value caption="896 periods of DACClock" name="_896" value="0xE"/>
        <value caption="960 periods of DACClock" name="_960" value="0xF"/>
        <value caption="1024 periods of DACClock" name="_1024" value="0x10"/>
        <value caption="1088 periods of DACClock" name="_1088" value="0x11"/>
        <value caption="1152 periods of DACClock" name="_1152" value="0x12"/>
        <value caption="1216 periods of DACClock" name="_1216" value="0x13"/>
        <value caption="1280 periods of DACClock" name="_1280" value="0x14"/>
        <value caption="1344 periods of DACClock" name="_1344" value="0x15"/>
        <value caption="1408 periods of DACClock" name="_1408" value="0x16"/>
        <value caption="1472 periods of DACClock" name="_1472" value="0x17"/>
        <value caption="1536 periods of DACClock" name="_1536" value="0x18"/>
        <value caption="1600 periods of DACClock" name="_1600" value="0x19"/>
        <value caption="1664 periods of DACClock" name="_1664" value="0x1A"/>
        <value caption="1728 periods of DACClock" name="_1728" value="0x1B"/>
        <value caption="1792 periods of DACClock" name="_1792" value="0x1C"/>
        <value caption="1856 periods of DACClock" name="_1856" value="0x1D"/>
        <value caption="1920 periods of DACClock" name="_1920" value="0x1E"/>
        <value caption="1984 periods of DACClock" name="_1984" value="0x1F"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450J">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash Descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Set Lock Bit" name="SLB" value="0x08"/>
        <value caption="Clear Lock Bit" name="CLB" value="0x09"/>
        <value caption="Get Lock Bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM Bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM Bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM Bit" name="GGPB" value="0x0D"/>
        <value caption="Start Read Unique Identifier" name="STUI" value="0x0E"/>
        <value caption="Stop Read Unique Identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB Bit" name="GCALB" value="0x10"/>
      </value-group>
